At least one Rebar should be selected.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId NoRebarSelected { get; }
  Visual Basic
Public Shared ReadOnly Property NoRebarSelected As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ NoRebarSelected {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures RebarFailures Class
  Autodesk.Revit.DB Namespace